In [32]:
import pandas as pd

In [33]:
a=pd.DataFrame([1,2,3])

In [34]:
a

   0
0  1
1  2
2  3

In [35]:
a=pd.DataFrame([1,2,3],[4,5,6])

In [36]:
a

   0
4  1
5  2
6  3

In [37]:
a=pd.DataFrame([[1,2,3],[4,5,6]])

In [38]:
a

   0  1  2
0  1  2  3
1  4  5  6

In [39]:
a=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=["a","b","c"],index=["a","b","c"])

In [40]:
a

   a  b  c
a  1  2  3
b  4  5  6
c  7  8  9

In [41]:
a=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=["A","B","C"],index=["1","2","3"])

In [42]:
a

   A  B  C
1  1  2  3
2  4  5  6
3  7  8  9

In [43]:
a.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 1 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [56]:
a=pd.DataFrame([[1,2,3],[4,5,6]])

In [57]:
a

   0  1  2
0  1  2  3
1  4  5  6

In [61]:
a.describe()

             0        1        2
count  2.00000  2.00000  2.00000
mean   2.50000  3.50000  4.50000
std    2.12132  2.12132  2.12132
min    1.00000  2.00000  3.00000
25%    1.75000  2.75000  3.75000
50%    2.50000  3.50000  4.50000
75%    3.25000  4.25000  5.25000
max    4.00000  5.00000  6.00000

In [62]:
a.nunique()

0    2
1    2
2    2
dtype: int64

In [64]:
a[0].unique()

array([1, 4], dtype=int64)